Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.6/phy/source/MKW41Z/Phy.h
/*!
* The Clear BSD License
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2017 NXP
* All rights reserved.
*
* \file
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted (subject to the limitations in the
* disclaimer below) provided that the following conditions are met:
* 
* * Redistributions of source code must retain the above copyright
*   notice, this list of conditions and the following disclaimer.
* 
* * Redistributions in binary form must reproduce the above copyright
*   notice, this list of conditions and the following disclaimer in the
*   documentation and/or other materials provided with the distribution.
* 
* * Neither the name of the copyright holder nor the names of its
*   contributors may be used to endorse or promote products derived from
*   this software without specific prior written permission.
* 
* NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
* GRANTED BY THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
* HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
* WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
* BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
* WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
* OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
* IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

#ifndef __PHY_H__
#define __PHY_H__


/*! *********************************************************************************
*************************************************************************************
* Include
*************************************************************************************
********************************************************************************** */
#include "EmbeddedTypes.h"
#include "PhyInterface.h"
#include "fsl_os_abstraction.h"


/*! *********************************************************************************
*************************************************************************************
* Private macros
*************************************************************************************
********************************************************************************** */
#define mFrameCtrlLo_d       (0)
#define mFrameCtrlHi_d       (1)
#define mAddressingFields_d  (3)

#define mShortAddr_d         (2)
#define mExtAddr_d           (3)
#define mNoAddr_d            (0)
#define mPanIdCompression_d  (1 << 6)
#define mDstAddrModeMask_d   (0x0C)
#define mDstAddrModeShift_d  (2)
#define mSrcAddrModeMask_d   (0xC0)
#define mSrcAddrModeShift_d  (6)


/*! *********************************************************************************
*************************************************************************************
* Public macros
*************************************************************************************
********************************************************************************** */
 
#ifdef __cplusplus
    extern "C" {
#endif

/* The interval at which the Phy will poll for a new buffer in order to start the RX */
#ifndef gPhyRxRetryInterval_c
#define gPhyRxRetryInterval_c         (60) /* [symbols] */
#endif

#ifndef gPhyUseNeighborTable_d
#define gPhyUseNeighborTable_d        (0)
#endif
       
#ifndef gUsePBTransferThereshold_d
#define gUsePBTransferThereshold_d    (0)
#endif

#define PhyGetSeqState()              PhyPpGetState()
#define PhyPlmeForceTrxOffRequest()   PhyAbort()

#ifndef gPhyDefaultRxWatermarkLevel_d
#define gPhyDefaultRxWatermarkLevel_d (5)
#endif

/* XCVR idle power mode */
#define gPhyDefaultIdlePwrMode_c   gPhyPwrIdle_c

/* Set the default power level to 0dBm */
#ifndef gPhyDefaultTxPowerLevel_d
#define gPhyDefaultTxPowerLevel_d     (22)
#endif

#define gPhyMaxTxPowerLevel_d         (32)
        
/* Tx Power level limit for each individual channel */
#ifndef gChannelTxPowerLimit_c
#define gChannelTxPowerLimit_c { gPhyMaxTxPowerLevel_d,   /* 11 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 12 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 13 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 14 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 15 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 16 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 17 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 18 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 19 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 20 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 21 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 22 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 23 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 24 */ \
                                 gPhyMaxTxPowerLevel_d,   /* 25 */ \
                                 gPhyMaxTxPowerLevel_d }  /* 26 */
#endif
      
/*! *********************************************************************************
*************************************************************************************
* Public type definitions
*************************************************************************************
********************************************************************************** */
/* PHY states */
enum {
  gIdle_c,
  gRX_c,
  gTX_c,
  gCCA_c,
  gTR_c,
  gCCCA_c,
};

/* PHY channel state */
enum {
  gChannelIdle_c,
  gChannelBusy_c
};

/* PANCORDNTR bit in PP */
enum {
  gMacRole_DeviceOrCoord_c,
  gMacRole_PanCoord_c
};

/* Cca types */
enum {
  gCcaED_c,            /* energy detect - CCA bit not active, not to be used for T and CCCA sequences */
  gCcaCCA_MODE1_c,     /* energy detect - CCA bit ACTIVE */
  gCcaCCA_MODE2_c,     /* 802.15.4 compliant signal detect - CCA bit ACTIVE */
  gCcaCCA_MODE3_c,     /* 802.15.4 compliant signal detect and energy detect - CCA bit ACTIVE */
  gInvalidCcaType_c    /* illegal type */
};

enum {
  gNormalCca_c,
  gContinuousCca_c
};

typedef struct Phy_PhyLocalStruct_tag
{
    PD_MAC_SapHandler_t         PD_MAC_SapHandler;
    PLME_MAC_SapHandler_t       PLME_MAC_SapHandler;
    msgQueue_t                  macPhyInputQueue;
    uint32_t                    maxFrameWaitTime;
    phyTxParams_t               txParams;
    phyRxParams_t               rxParams;
    phyChannelParams_t          channelParams;
    volatile uint8_t            flags;
    uint8_t                     currentMacInstance;
}Phy_PhyLocalStruct_t;


/*! *********************************************************************************
*************************************************************************************
* Public prototypes
*************************************************************************************
********************************************************************************** */

/* PHY Packet Processor */

/*! *********************************************************************************
 * \brief  Initialize the XCVR HW
 *
 ********************************************************************************** */
void PhyHwInit
( 
  void 
);

/*! *********************************************************************************
 * \brief  Enable/Disable the XCVR promiscuous mode. 
 *         In promiscuous mode, all filtering except CRC are disabled
 * 
 * \param[in] mode  TRUE - Promiscuous On
 *                  FALSE - Promiscous Off
 *
 ********************************************************************************** */
void PhyPpSetPromiscuous
(
  bool_t mode
);

/*! *********************************************************************************
 * \brief  Enable/Disable the XCVR active promiscuous mode. 
 *         In active promiscuous mode, all filtering except CRC are disabled.
 *         Also, the XCVR will send ACK to frames with destination address equal to 
 *         the device's address
 * 
 * \param[in] sate  TRUE - Promiscuous On
 *                  FALSE - Promiscous Off
 *
********************************************************************************** */
void PhySetActivePromiscuous
(
bool_t state
);

/*! *********************************************************************************
* \brief Returns the state of the Active Promiscuous feature
*
********************************************************************************** */
bool_t PhyGetActivePromiscuous
(
void
);

/*! *********************************************************************************
 * \brief Set the device's PAN Id
 *
 * \param
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPpSetPanId
(
  uint8_t *pPanId,
  uint8_t pan
);

/*! *********************************************************************************
 * \brief Set the device's Short Address
 *
 * \param
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPpSetShortAddr
(
  uint8_t *pShortAddr,
  uint8_t pan
);


/*! *********************************************************************************
 * \brief Set the device's IEEE Address
 *
 * \param
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPpSetLongAddr
(
  uint8_t *pLongAddr,
  uint8_t pan
);

/*! *********************************************************************************
 * \brief Set the device's role: Pan coordinator or not
 *
 * \param
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPpSetMacRole
(
  bool_t macRole,
  uint8_t pan
);

/*! *********************************************************************************
 * \brief Get the state of the FP bit sent in last ACK frame
 *
 * \return state of FP bit
 *
 ********************************************************************************** */
bool_t PhyPpIsTxAckDataPending
(
  void
);

/*! *********************************************************************************
 * \brief Get the state of the FP bit of the last received ACK frame
 *
 * \return state of FP bit
 *
 ********************************************************************************** */
bool_t PhyPpIsRxAckDataPending
(
  void
);

/*! *********************************************************************************
 * \brief Set the value of the FP bit for the next ACK frame
 *
 * \param[in] FP value of FP bit
 *
 ********************************************************************************** */
void PhyPpSetFpManually
(
  bool_t FP
);

/*! *********************************************************************************
 * \brief Check if the lasr received packet was a Poll Request
 *
 * \return TRUE if the received packet is a Poll Request
 *
 ********************************************************************************** */
bool_t PhyPpIsPollIndication
(
  void
);

/*! *********************************************************************************
 * \brief Enable/Disable Source Addressing Match feature
 *
 * \param[in] state of the SAM feature
 *
 ********************************************************************************** */
void PhyPpSetSAMState
(
  bool_t state
);

/*! *********************************************************************************
 * \brief Add a new entry into the HW indirect queue
 *
 * \param[in] index The table position
 * \param[in] checkSum The device hash code
 * \param[in] instanceId The instance of the PHY
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPp_IndirectQueueInsert
(
  uint8_t  index,
  uint16_t checkSum,
  instanceId_t instanceId
);

/*! *********************************************************************************
 * \brief Remove an entry from the HW indirect queue
 *
 * \param[in] index The table position
 * \param[in] instanceId The instance of the PHY
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPp_RemoveFromIndirect
(
  uint8_t index,
  instanceId_t instanceId
);

/*! *********************************************************************************
 * \brief Get the current state of the XCVR
 *
 * \return state
 *
 ********************************************************************************** */
uint8_t PhyPpGetState
(
  void
);

/*! *********************************************************************************
 * \brief Abort the current XCVR sequence
 *
 ********************************************************************************** */
void PhyAbort
(
  void
);

/* PHY PLME & DATA primitives */

/*! *********************************************************************************
 * \brief Start a TX sequence
 *
 * \param[in] pTxPacket Pointer to the PD request
 * \param[in] pRxParams Pointer to the Rx parameters
 * \param[in] pTxParams Pointer to the Tx parameters
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPdDataRequest
(  
  pdDataReq_t *pTxPacket,  
  volatile phyRxParams_t *pRxParams, 
  volatile phyTxParams_t *pTxParams
);

/*! *********************************************************************************
 * \brief Start an RX sequence
 *
 * \param[in] phyRxMode Slotted/Unslotted
 * \param[in] pRxParams Pointer to the Rx parameters
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeRxRequest
(
  phySlottedMode_t phyRxMode,
  phyRxParams_t *  pRxParams
);

/*! *********************************************************************************
 * \brief Start a immed RX sequence
 *
 * \param[in] pRxParams Pointer to the Rx parameters
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeTimmedRxRequest( phyRxParams_t *  pRxParams );

/*! *********************************************************************************
 * \brief Start a CCA or ED sequence
 *
 * \param[in] ccaParam  type of CCA
 * \param[in] cccaMode  continuous or single operation
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeCcaEdRequest
(
  phyCCAType_t     ccaParam,
  phyContCCAMode_t cccaMode
);

/*! *********************************************************************************
 * \brief Set the current 802.15.4 channel
 *
 * \param[in] channel number [11-26]
 * \param[in] pan index of the PAN
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeSetCurrentChannelRequest
(
  uint8_t channel,
  uint8_t pan
);

/*! *********************************************************************************
 * \brief Get the current 802.15.4 channel
 *
 * \param[in] pan index of the PAN
 *
 * \return status
 *
 ********************************************************************************** */
uint8_t PhyPlmeGetCurrentChannelRequest
(
  uint8_t pan
);

/*! *********************************************************************************
 * \brief Set the TX power level
 *
 * \param[in] pwrStep  the Tx power level
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeSetPwrLevelRequest
(
  uint8_t pwrStep
);

/*! *********************************************************************************
 * \brief Get the TX power level
 *
 * \return current power level
 *
 ********************************************************************************** */
uint8_t PhyPlmeGetPwrLevelRequest
(
  void
);

/*! *********************************************************************************
 * \brief Set a PHY PIB
 *
 * \param[in] pibId           The Id of the PIB
 * \param[in] pibValue        The value of the PIB
 * \param[in] phyRegistrySet  The index of the PAN
 * \param[in] instanceId      The instance of the PHY
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeSetPIBRequest
(
  phyPibId_t pibId,
  uint64_t pibValue,
  uint8_t phyRegistrySet,
  instanceId_t instanceId
);

/*! *********************************************************************************
 * \brief Get a PHY PIB
 *
 * \param[in] pibId           The Id of the PIB
 * \param[in] pibValue        Pointer to a location where the value will be stored
 * \param[in] phyRegistrySet  The index of the PAN
 * \param[in] instanceId      The instance of the PHY
 *
 * \return status
 *
 ********************************************************************************** */
phyStatus_t PhyPlmeGetPIBRequest
(
  phyPibId_t pibId,
  uint64_t * pibValue,
  uint8_t phyRegistrySet, 
  instanceId_t instanceId
);

/*! *********************************************************************************
 * \brief Set the value of the CCA Threshold
 *
 * \param[in] ccaThreshold  the threshold value
 *
 * \return status
 *
 ********************************************************************************** */

