Masmiseim36/nxpSDK/middleware/wireless/ieee_802_15_4_5.3.6/phy/source/MKW41Z/Phy.h
phyStatus_t PhyPpSetCcaThreshold
(
  uint8_t ccaThreshold
);

/* PHY Time */

/*! *********************************************************************************
 * \brief Set the absolute start time of the next sequence
 *
 * \param[in] startTime the sequence's absolute start time
 * 
 ********************************************************************************** */
void PhyTimeSetEventTrigger
(
  phyTime_t startTime
);

/*! *********************************************************************************
 * \brief Set the absolute end time of the next sequence
 *
 * \param[in] pEndTime pointer to the sequence's absolute end time
 * 
 ********************************************************************************** */
void PhyTimeSetEventTimeout
(
  phyTime_t *pEndTime
);

/*! *********************************************************************************
 * \brief Get the absolute end time of the next sequence
 * 
 * \return the sequence timeout
 *
 ********************************************************************************** */
phyTime_t PhyTimeGetEventTimeout( void );

/*! *********************************************************************************
 * \brief Read the XCVR timer
 *
 * \param[out] pRetClk pointer to a location where the current time will be stored
 *
 ********************************************************************************** */
void PhyTimeReadClock
(
  phyTime_t *pRetClk
);

/*! *********************************************************************************
 * \brief Disable the sequence timeout
 * 
 ********************************************************************************** */
void PhyTimeDisableEventTimeout
(
  void
);

/*! *********************************************************************************
 * \brief Disable the sequence start time trigger.
 * 
 ********************************************************************************** */
void PhyTimeDisableEventTrigger
(
  void
);

/*! *********************************************************************************
 * \brief Program a timer to wake up the MCU from low power
 *
 * \param[in] pWakeUpTime  pointer to the timer's value
 * 
 ********************************************************************************** */
void PhyTimeSetWakeUpTime
(
  uint32_t *pWakeUpTime
);

/*! *********************************************************************************
 * \brief Set the value of the XCVR timer
 *
 * \param[in] pAbsTime  pointer to the timer's value
 *
 ********************************************************************************** */
void PhyTimeInitEventTimer
(
  uint32_t *pAbsTime
);

/*! *********************************************************************************
 * \brief Check if the wake-up timed has expired and disable it.
 *
 * \return TRUE if timer has expired, else FALSE
 *
 ********************************************************************************** */
bool_t PhyTimeIsWakeUpTimeExpired
(
  void
);

/*! *********************************************************************************
 * \brief Program an XCVR wait indication
 *
 * \param[in] pWaitTimeout pointer to the absolute time of the event
 *
 ********************************************************************************** */
void PhyTimeSetWaitTimeout
(
  phyTime_t *pWaitTimeout
);

/*! *********************************************************************************
 * \brief Disable XCVR event indication
 *
 ********************************************************************************** */
void PhyTimeDisableWaitTimeout
(
  void
);

/* PHY ISR */

/*! *********************************************************************************
 * \brief Installs the XCVR interrupt
 *
 ********************************************************************************** */
void PHY_InstallIsr
(
  void
);

/*! *********************************************************************************
* \brief  This function forces the PHY IRQ to be triggered to run the ISR
*
********************************************************************************** */
void PHY_ForceIrqPending
(
  void
);

/*! *********************************************************************************
 * \brief Check is an XCVR IRQ is pending
 *
 * \return  TRUE if ISR pending, else FALSE
 *
 ********************************************************************************** */
bool_t PHY_isIrqPending
(
  void
);

/*! *********************************************************************************
 * \brief This is the XCVR ISR
 *
 ********************************************************************************** */
void PHY_InterruptHandler
(
  void
);


/*! *********************************************************************************
 * \brief Set the pointer to the location where packet related information will be stored
 *        Set to NULL if no packet details are needed
 *
 * \param[in] pRxParam pointer to the Rx parameters
 *
 ********************************************************************************** */
void PhyIsrPassRxParams
(
  volatile phyRxParams_t * pRxParam
);

/*! *********************************************************************************
* \brief Returns a random number from PHY
*
* \return random number
* 
********************************************************************************** */
void PhyGetRandomNo
(
  uint32_t *pRandomNo
);

/*! *********************************************************************************
* \brief Set the state of the Dual PAN automatic mode
*
* \param[in] mode of the Dual PAN automatic mode
*
********************************************************************************** */
void PhyPpSetDualPanAuto
(
  bool_t mode
);

/*! *********************************************************************************
* \brief Get the state of the Dual PAN automatic mode
*
* \return the state of the Dual PAN automatic mode
*
********************************************************************************** */
bool_t PhyPpGetDualPanAuto
(
   void
);

/*! *********************************************************************************
* \brief Set the Dual PAN Dwell switch time 
*
********************************************************************************** */
void PhyPpSetDualPanDwell
(
  uint8_t dwell
);

/*! *********************************************************************************
* \brief Get the Dual PAN Dwell switch time 
*
* \return dwell time
*
********************************************************************************** */
uint8_t PhyPpGetDualPanDwell
(
  void
);

/*! *********************************************************************************
* \brief Get the remaining time until a channel switch will occure
*
* \return remaining time until PAN switch wil occur
* 
********************************************************************************** */
uint8_t PhyPpGetDualPanRemain
(
  void
);

/*! *********************************************************************************
* \brief Set the level at which the HW queue is split for the two PANs
*
* \param[in] queue split level
*
********************************************************************************** */
void PhyPpSetDualPanSamLvl
(
  uint8_t level
);

/*! *********************************************************************************
* \brief Returns the level at which the HW queue is split for the two PANs
*
* \return queue split level
*
********************************************************************************** */
uint8_t PhyPpGetDualPanSamLvl
(
  void
);

/*! *********************************************************************************
* \brief Set the active PAN
*
* \param[in] the index of the PAN
*
********************************************************************************** */
void PhyPpSetDualPanActiveNwk
(
  uint8_t nwk
);

/*! *********************************************************************************
* \brief Returns the current NWK on which the PHY is operating
*
* \return the index of the active PAN
* 
********************************************************************************** */
uint8_t PhyPpGetDualPanActiveNwk
(
  void
);

/*! *********************************************************************************
* \brief Return the PAN on which the packet was received (can be receiced on both PANs)
*
* \return the PAN index
* 
********************************************************************************** */
uint8_t PhyPpGetPanOfRxPacket
(
  void
);

/*! *********************************************************************************
* \brief Return the LQI value for the last received packet
*
* \return LQI
* 
********************************************************************************** */
uint8_t PhyGetLastRxLqiValue(void);

/*! *********************************************************************************
* \brief Returns the RSSI value for the last received packet
*
* \return RSSI
*
********************************************************************************** */
uint8_t PhyGetLastRxRssiValue(void);

/*! *********************************************************************************
* \brief  This function converts the LQI reported by the PHY into an signed RSSI value
*
* \param[in]  LQI  the LQI reported by the PHY
*
* \return  the RSSI value in dbm
*
********************************************************************************** */
int8_t PhyConvertLQIToRSSI(uint8_t lqi);

/*! *********************************************************************************
* \brief Enable the FAD function (FAD_EN bit)
*
* \param[in] state , the state of the FAD feature
*
* \return gPhySuccess
*
********************************************************************************** */
uint8_t PhyPlmeSetFADStateRequest(bool_t state);

/*! *********************************************************************************
* \brief Correlator threshold at which the FAD will select the antenna
*
* \return gPhySuccess
*
********************************************************************************** */
uint8_t PhyPlmeSetFADThresholdRequest(uint8_t FADThreshold);

/*! *********************************************************************************
* \brief Enable the ANT pads
*
* \param[in] antAB_on - 
* \param[in] rxtxSwitch_on - 
*
* \return gPhySuccess
*
********************************************************************************** */
uint8_t PhyPlmeSetANTPadStateRequest(bool_t antAB_on, bool_t rxtxSwitch_on);

/*! *********************************************************************************
* \brief Invert the logic of the ANT pads
*
* \param[in] invAntA - invert the ANT_A pad
* \param[in] invAntB - invert the ANT_A pad
* \param[in] invTx   - invert the ANT_TX pad
* \param[in] invRx   - invert the ANT_RX pad
*
* \return gPhySuccess
*
********************************************************************************** */
uint8_t PhyPlmeSetANTPadInvertedRequest(bool_t invAntA, bool_t invAntB, bool_t invTx, bool_t invRx);

/*! *********************************************************************************
* \brief ANTX_IN - FAD Antenna start when FAD_EN = 1 or antenna selected
*              when FAD_EN=0
*
* \return gPhySuccess
*
********************************************************************************** */
uint8_t PhyPlmeSetANTXStateRequest(bool_t state);

/*! *********************************************************************************
* \brief Antenna selected in FAD of non-FAD mode
*
* \return Chosen antenna by the FAD (FAD_EN = 1) or copy of ANTX_IN
*
********************************************************************************** */
uint8_t PhyPlmeGetANTXStateRequest(void);

/*! *********************************************************************************
* \brief Choose LQI Mode: 1 - LQI Based on RSSI, 
*                         0 - LQI Based on Correlation Peaks
*
* \return gPhySuccess
*
********************************************************************************** */
uint8_t PhyPlmeSetLQIModeRequest(uint8_t lqiMode);

/*! *********************************************************************************
* \brief Returns the RSSI level value, refreshed every 125us
*
* \return RSSI level [dbm]
*
********************************************************************************** */
uint8_t PhyPlmeGetRSSILevelRequest(void);

/*! *********************************************************************************
* \brief Informs the PHY if it should start an RX when entering IDLE or not
*
* \param[in] state      - if TRUE the XCVR will start an Rx when Idle
* \param[in] instanceId - the instance of the PHY
*
********************************************************************************** */
void PhyPlmeSetRxOnWhenIdle( bool_t state, instanceId_t instanceId );

/*! *********************************************************************************
* \brief  Set the amount of time in symbols to wait for an data frame 
*         after receiving an ACK with FP=1
*
* \param[in] time       - the response wait time in symbols
* \param[in] instanceId - the instance of the PHY
*
********************************************************************************** */
void PhyPlmeSetFrameWaitTime( uint32_t maxTime, instanceId_t instanceId );

/*! *********************************************************************************
* \brief Set the start time and end time for an XCVR sequence
*
* \param[in] startTime   - absolute start time in symbols
* \param[in] seqDuration - sequence duration in symbols
*              
********************************************************************************** */
void Phy_SetSequenceTiming(phyTime_t startTime, uint32_t seqDuration);

/*! *********************************************************************************
* \brief  Scales energy level to 0-255
*
* \param[in]  energyLevel  the energy level reported by HW
*
* \return  uint8_t  the energy level scaled in 0x00-0xFF
*
********************************************************************************** */
uint8_t Phy_GetEnergyLevel(uint8_t energyLevel);

/*! *********************************************************************************
* \brief  Disable the XCVR interrupts
*
********************************************************************************** */
void ProtectFromXcvrInterrupt(void);

/*! *********************************************************************************
* \brief  Enable the XCVR interrupts
*
********************************************************************************** */
void UnprotectFromXcvrInterrupt(void);


/* PHY Neihbor Table API */
uint16_t PhyGetChecksum(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId);

uint8_t  PhyAddToNeighborTable(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId);

uint8_t  PhyRemoveFromNeighborTable(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId);

bool_t   PhyCheckNeighborTable(uint16_t checksum);

void     PhyResetNeighborTable(void);


/* RADIO EVENTS */

void Radio_Phy_PdDataConfirm(instanceId_t instanceId, bool_t framePending);

void Radio_Phy_TimeWaitTimeoutIndication(instanceId_t instanceId);

void Radio_Phy_TimeRxTimeoutIndication(instanceId_t instanceId);

void Radio_Phy_PdDataIndication(instanceId_t instanceId);

void Radio_Phy_TimeStartEventIndication(instanceId_t instanceId);

void Radio_Phy_PlmeCcaConfirm(phyStatus_t phyChannelStatus, instanceId_t instanceId);

void Radio_Phy_PlmeEdConfirm(uint8_t energyLeveldB, instanceId_t instanceId);

void Radio_Phy_PlmeSyncLossIndication(instanceId_t instanceId);

void Radio_Phy_PlmeRxWatermark(instanceId_t instanceId, uint32_t frameLength);

void Radio_Phy_PlmeFilterFailRx(instanceId_t instanceId);

void Radio_Phy_UnexpectedTransceiverReset(instanceId_t instanceId);

void Radio_Phy_DummyEvent(instanceId_t instanceId);

bool_t PhyIsIdleRx( instanceId_t instanceId );

void Radio_Phy_Notify(void);

#if defined(__IAR_SYSTEMS_ICC__)
extern __weak void PWR_AllowXcvrToSleep(void);
extern __weak void PWR_DisallowXcvrToSleep(void);
extern __weak void PhyTime_TMR4Callback(void);
#elif defined(__GNUC__)
extern void PWR_AllowXcvrToSleep(void) __attribute__((weak));
extern void PWR_DisallowXcvrToSleep(void) __attribute__((weak));
extern void PhyTime_TMR4Callback(void) __attribute__((weak));
#endif

#ifdef __cplusplus
}
#endif

#endif /* __PHY_H__ */
